; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	thermograph3 - mode
	infrared2 - mode
	infrared0 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 173)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon7)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 113)
	(supports instrument3 thermograph3)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 164)
	(supports instrument6 infrared0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 174)
	(= (data Star5 thermograph3) 171)
	(= (data Planet6 thermograph3) 166)
	(= (data Phenomenon7 thermograph3) 273)
	(= (data Star8 thermograph3) 262)
	(= (data Star5 infrared2) 108)
	(= (data Planet6 infrared2) 235)
	(= (data Phenomenon7 infrared2) 133)
	(= (data Star8 infrared2) 78)
	(= (data Star5 infrared0) 184)
	(= (data Planet6 infrared0) 229)
	(= (data Phenomenon7 infrared0) 271)
	(= (data Star8 infrared0) 100)
	(= (data Star5 thermograph1) 107)
	(= (data Planet6 thermograph1) 284)
	(= (data Phenomenon7 thermograph1) 227)
	(= (data Star8 thermograph1) 128)
	(= (slew_time GroundStation2 Star0) 32.83)
	(= (slew_time Star0 GroundStation2) 32.83)
	(= (slew_time GroundStation2 GroundStation1) 13.84)
	(= (slew_time GroundStation1 GroundStation2) 13.84)
	(= (slew_time GroundStation4 Star0) 7.996)
	(= (slew_time Star0 GroundStation4) 7.996)
	(= (slew_time GroundStation4 GroundStation1) 27.89)
	(= (slew_time GroundStation1 GroundStation4) 27.89)
	(= (slew_time GroundStation4 GroundStation2) 76.99)
	(= (slew_time GroundStation2 GroundStation4) 76.99)
	(= (slew_time GroundStation4 GroundStation3) 47.47)
	(= (slew_time GroundStation3 GroundStation4) 47.47)
	(= (slew_time GroundStation1 Star0) 31.4)
	(= (slew_time Star0 GroundStation1) 31.4)
	(= (slew_time GroundStation3 Star0) 27.17)
	(= (slew_time Star0 GroundStation3) 27.17)
	(= (slew_time GroundStation3 GroundStation1) 79.14)
	(= (slew_time GroundStation1 GroundStation3) 79.14)
	(= (slew_time GroundStation3 GroundStation2) 12.92)
	(= (slew_time GroundStation2 GroundStation3) 12.92)
	(= (slew_time Star5 Star0) 81.64)
	(= (slew_time Star0 Star5) 81.64)
	(= (slew_time Star5 GroundStation1) 69.94)
	(= (slew_time GroundStation1 Star5) 69.94)
	(= (slew_time Star5 GroundStation2) 52.3)
	(= (slew_time GroundStation2 Star5) 52.3)
	(= (slew_time Star5 GroundStation3) 20.74)
	(= (slew_time GroundStation3 Star5) 20.74)
	(= (slew_time Star5 GroundStation4) 46.73)
	(= (slew_time GroundStation4 Star5) 46.73)
	(= (slew_time Planet6 Star0) 44.11)
	(= (slew_time Star0 Planet6) 44.11)
	(= (slew_time Planet6 GroundStation1) 28.61)
	(= (slew_time GroundStation1 Planet6) 28.61)
	(= (slew_time Planet6 GroundStation2) 16.01)
	(= (slew_time GroundStation2 Planet6) 16.01)
	(= (slew_time Planet6 GroundStation3) 3.511)
	(= (slew_time GroundStation3 Planet6) 3.511)
	(= (slew_time Planet6 GroundStation4) 74.39)
	(= (slew_time GroundStation4 Planet6) 74.39)
	(= (slew_time Planet6 Star5) 40.02)
	(= (slew_time Star5 Planet6) 40.02)
	(= (slew_time Phenomenon7 Star0) 4.571)
	(= (slew_time Star0 Phenomenon7) 4.571)
	(= (slew_time Phenomenon7 GroundStation1) 1.832)
	(= (slew_time GroundStation1 Phenomenon7) 1.832)
	(= (slew_time Phenomenon7 GroundStation2) 57.85)
	(= (slew_time GroundStation2 Phenomenon7) 57.85)
	(= (slew_time Phenomenon7 GroundStation3) 52.31)
	(= (slew_time GroundStation3 Phenomenon7) 52.31)
	(= (slew_time Phenomenon7 GroundStation4) 28.3)
	(= (slew_time GroundStation4 Phenomenon7) 28.3)
	(= (slew_time Phenomenon7 Star5) 88.07)
	(= (slew_time Star5 Phenomenon7) 88.07)
	(= (slew_time Phenomenon7 Planet6) 23.36)
	(= (slew_time Planet6 Phenomenon7) 23.36)
	(= (slew_time Star8 Star0) 12.31)
	(= (slew_time Star0 Star8) 12.31)
	(= (slew_time Star8 GroundStation1) 16.39)
	(= (slew_time GroundStation1 Star8) 16.39)
	(= (slew_time Star8 GroundStation2) 48.99)
	(= (slew_time GroundStation2 Star8) 48.99)
	(= (slew_time Star8 GroundStation3) 27.35)
	(= (slew_time GroundStation3 Star8) 27.35)
	(= (slew_time Star8 GroundStation4) 40.52)
	(= (slew_time GroundStation4 Star8) 40.52)
	(= (slew_time Star8 Star5) 49.73)
	(= (slew_time Star5 Star8) 49.73)
	(= (slew_time Star8 Planet6) 9.785)
	(= (slew_time Planet6 Star8) 9.785)
	(= (slew_time Star8 Phenomenon7) 10.04)
	(= (slew_time Phenomenon7 Star8) 10.04)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 Star0)
	(pointing satellite2 Star8)
	(have_image Star5 infrared2)
	(have_image Planet6 infrared2)
	(have_image Phenomenon7 thermograph1)
	(have_image Star8 infrared0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 star0 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 113 to 108.429, (fuel-used) from 0 to 4.571
   goals met: 2 of 6
2. (turn_to satellite2 groundstation1 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 164 to 147.61, (fuel-used) from 4.571 to 20.961
   goals met: 1 of 6
3. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 6
4. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 1 of 6
5. (turn_to satellite2 phenomenon7 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 147.61 to 145.778, (fuel-used) from 20.961 to 22.793
   goals met: 1 of 6
6. (turn_to satellite2 star0 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 145.778 to 141.207, (fuel-used) from 22.793 to 27.364
   goals met: 1 of 6
7. (turn_to satellite2 phenomenon7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 141.207 to 136.636, (fuel-used) from 27.364 to 31.935
   goals met: 1 of 6
8. (turn_to satellite2 star0 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 136.636 to 132.065, (fuel-used) from 31.935 to 36.506
   goals met: 1 of 6
9. (turn_to satellite2 phenomenon7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 132.065 to 127.494, (fuel-used) from 36.506 to 41.077
   goals met: 1 of 6
10. (turn_to satellite2 star0 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 127.494 to 122.923, (fuel-used) from 41.077 to 45.648
   goals met: 1 of 6
11. (turn_to satellite2 phenomenon7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 122.923 to 118.352, (fuel-used) from 45.648 to 50.219
   goals met: 1 of 6
12. (turn_to satellite2 star0 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 118.352 to 113.781, (fuel-used) from 50.219 to 54.79
   goals met: 1 of 6
13. (turn_to satellite2 phenomenon7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 113.781 to 109.21, (fuel-used) from 54.79 to 59.361
   goals met: 1 of 6
14. (turn_to satellite2 star0 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 109.21 to 104.639, (fuel-used) from 59.361 to 63.932
   goals met: 1 of 6
15. (turn_to satellite2 star8 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 104.639 to 92.329, (fuel-used) from 63.932 to 76.242
   goals met: 2 of 6
16. (turn_to satellite2 phenomenon7 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 92.329 to 82.289, (fuel-used) from 76.242 to 86.282
   goals met: 1 of 6
17. (turn_to satellite2 star0 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 82.289 to 77.718, (fuel-used) from 86.282 to 90.853
   goals met: 1 of 6
18. (turn_to satellite2 phenomenon7 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 77.718 to 73.147, (fuel-used) from 90.853 to 95.424
   goals met: 1 of 6
19. (switch_off instrument5 satellite2)
   deleted: (power_on instrument5)
   added: (power_avail satellite2)
   goals met: 1 of 6
20. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 6
21. (turn_to satellite2 star8 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 73.147 to 63.107, (fuel-used) from 95.424 to 105.464
   goals met: 2 of 6
22. (turn_to satellite2 phenomenon7 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 63.107 to 53.067, (fuel-used) from 105.464 to 115.504
   goals met: 1 of 6
23. (switch_off instrument3 satellite2)
   deleted: (power_on instrument3)
   added: (power_avail satellite2)
   goals met: 1 of 6
24. (switch_on instrument5 satellite2)
   deleted: (calibrated instrument5) (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 6
25. (turn_to satellite2 groundstation1 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 53.067 to 51.235, (fuel-used) from 115.504 to 117.336
   goals met: 1 of 6
26. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 1 of 6
27. (turn_to satellite2 star8 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 51.235 to 34.845, (fuel-used) from 117.336 to 133.726
   goals met: 2 of 6
28. (turn_to satellite2 phenomenon7 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 34.845 to 24.805, (fuel-used) from 133.726 to 143.766
   goals met: 1 of 6
29. (switch_off instrument5 satellite2)
   deleted: (power_on instrument5)
   added: (power_avail satellite2)
   goals met: 1 of 6
30. (switch_on instrument5 satellite2)
   deleted: (calibrated instrument5) (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 6
31. (turn_to satellite2 groundstation1 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 24.805 to 22.973, (fuel-used) from 143.766 to 145.598
   goals met: 1 of 6
32. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 1 of 6
33. (turn_to satellite2 phenomenon7 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon7)
   changed: (fuel satellite2) from 22.973 to 21.141, (fuel-used) from 145.598 to 147.43
   goals met: 1 of 6
34. (take_image satellite2 phenomenon7 instrument5 thermograph1)
   added: (have_image phenomenon7 thermograph1)
   changed: (data_capacity satellite2) from 1000 to 773, (data-stored) from 0 to 227
   goals met: 2 of 6
35. (switch_off instrument5 satellite2)
   deleted: (power_on instrument5)
   added: (power_avail satellite2)
   goals met: 2 of 6
36. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 2 of 6
37. (turn_to satellite2 star8 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 21.141 to 11.101, (fuel-used) from 147.43 to 157.47
   goals met: 3 of 6
38. (turn_to satellite1 groundstation1 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 108.429 to 77.029, (fuel-used) from 157.47 to 188.87
   goals met: 2 of 6
39. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 6
40. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 2 of 6
41. (turn_to satellite1 planet6 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 77.029 to 48.419, (fuel-used) from 188.87 to 217.48
   goals met: 2 of 6
42. (take_image satellite1 planet6 instrument2 infrared2)
   added: (have_image planet6 infrared2)
   changed: (data_capacity satellite1) from 1000 to 765, (data-stored) from 227 to 462
   goals met: 3 of 6
43. (turn_to satellite1 star0 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 48.419 to 4.309, (fuel-used) from 217.48 to 261.59
   goals met: 4 of 6
44. (turn_to satellite3 planet6 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 174 to 129.89, (fuel-used) from 261.59 to 305.7
   goals met: 4 of 6
45. (turn_to satellite3 star8 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star8)
   changed: (fuel satellite3) from 129.89 to 120.105, (fuel-used) from 305.7 to 315.485
   goals met: 4 of 6
46. (turn_to satellite3 planet6 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 120.105 to 110.32, (fuel-used) from 315.485 to 325.27
   goals met: 4 of 6
47. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 4 of 6
48. (turn_to satellite3 star5 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star5)
   changed: (fuel satellite3) from 110.32 to 70.3, (fuel-used) from 325.27 to 365.29
   goals met: 4 of 6
49. (turn_to satellite3 groundstation3 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 groundstation3)
   changed: (fuel satellite3) from 70.3 to 49.56, (fuel-used) from 365.29 to 386.03
   goals met: 4 of 6
50. (calibrate satellite3 instrument6 groundstation3)
   added: (calibrated instrument6)
   goals met: 4 of 6
51. (turn_to satellite3 planet6 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 49.56 to 46.049, (fuel-used) from 386.03 to 389.541
   goals met: 4 of 6
52. (turn_to satellite3 star8 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star8)
   changed: (fuel satellite3) from 46.049 to 36.264, (fuel-used) from 389.541 to 399.326
   goals met: 4 of 6
53. (take_image satellite3 star8 instrument6 infrared0)
   added: (have_image star8 infrared0)
   changed: (data_capacity satellite3) from 1000 to 900, (data-stored) from 462 to 562
   goals met: 5 of 6
54. (turn_to satellite3 planet6 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 36.264 to 26.479, (fuel-used) from 399.326 to 409.111
   goals met: 5 of 6
55. (turn_to satellite3 groundstation3 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 groundstation3)
   changed: (fuel satellite3) from 26.479 to 22.968, (fuel-used) from 409.111 to 412.622
   goals met: 5 of 6
56. (turn_to satellite3 star5 groundstation3)
   deleted: (pointing satellite3 groundstation3)
   added: (pointing satellite3 star5)
   changed: (fuel satellite3) from 22.968 to 2.228, (fuel-used) from 412.622 to 433.362
   goals met: 5 of 6
57. (take_image satellite3 star5 instrument6 infrared2)
   added: (have_image star5 infrared2)
   changed: (data_capacity satellite3) from 900 to 792, (data-stored) from 562 to 670
   goals met: 6 of 6
